#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>
//移位操作符讲解
//int main()
//{
//	int a = 5;//00000000000000000000000000000101
//	//二进制有三种形式：原码，补码，反码
//	//正数的源码，反码，补码相同
//	//负数的源码，反码，补码不相同
//	//内存中的二进制是以补码的形式存在
//	//左移操作符： <<     左边丢弃，右边补1
//	//移动的是存储在内存中的二进制的补码
//	int b = a << 1;//00000000000000000000000000001010
//	printf("%d\n", b);
//	return 0;
//}

//负数
//int main()
//{
//	int a = -1;
//	//10000000000000000000000000000001
//	//负数二进制位最高位是 1 ，正数二进制位最高位是 0 
//	int b = a << 1;
//	//先取反码
//	//11111111111111111111111111111110
//	//再取补码：反码+1
//	//11111111111111111111111111111111
//	//在进行右移操作
//	//11111111111111111111111111111110
//	//再减1，取得反码
//	//11111111111111111111111111111101
//	//在按位取反，获得原码
//	//10000000000000000000000000000010
//	printf("%d\n", b);
//	return 0;
//}

//右移操作符
//int main()
//{
//	int a =-3;
//	int b = a >> 1;
//
//
//	// 1.算术右移
//	// 右边丢弃，左边补原来的符号位
//	// 不同的操作系统电脑采用的右移方式不同，我这里是算术右移
//
//	// 2.逻辑右移
//	// 右边丢弃，左边补 0
//	// 10000000000000000000000000000011
//	// 11111111111111111111111111111100
//	// 11111111111111111111111111111101
//	// 11111111111111111111111111111110
//	// 11111111111111111111111111111101
//	// 10000000000000000000000000000010
//	//结果是  -2
//	printf("%d\n", b);
//}


//int main()
//{
//	int a = 3;
//	int  b = 5;
//	int c = a&b;
//	int d = a | b;
//	int f = a^b;
//	//按（二进制）位与
//	//011
//	//101
//	//001
//
//	//按（二进制）位或 
//	//011
//	//101
//	//111
//
//	//按（二进制）位异或 ——相同为 0，相异为 1
//	//011
//	//101
//	//110
//	printf("%d\n", c);
//	printf("%d\n", d);
//	printf("%d\n", f);
//	return 0;
//}

//交换两个变量，不能创建临时变量
//int main()
//{
//	int a = 3;
//	int b = 5;
//	a = a^b;
//	b = a^b;
//	a = a^b;
//	printf("%d %d\n", a, b);
//	return 0;
//}